<!DOCTYPE html>
<html>
			<head>
						<link rel="stylesheet" type="text/css" href="estlos.css">
						<title>1.2.4.1 Tipos de Buses</title>
			</head>
					<body>
							<header>
							
								<body style =" background-color: white; color: black; background attachment: fixed 100%; background-size: 100%; background-image: url(imagenes/fondo.jpg); link = # 32CD32; vlink = #32CD32; overflow: visible;" >	
				
								<h2 style ="font-family: courrier; color: white;   text-align: center;">1.2.4   Buses </h2> 

								<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous"/>	
				

									<a href="index.html" class="btn btn-primary">Inicio</a>
									<a href="unidad1.html" class="btn btn-primary">Volver atr&aacute;s</a>
			</header>

									<center><h2>1.2.4.1 Tipos de Buses</h2></center>
									<center>
									  
									 <center><h2> </h2></center>
									<br><br>
									 Bus es una palabra inglesa que significa “transporte”. En arquitectura de computadores, un bus puede conectar l&oacute;gicamente varios perif&eacute;ricos sobre el mismo conjunto de cables. Aplicada a la inform&aacute;tica, se relaciona con la idea de las transferencias internas de datos que se dan en un sistema computacional en funcionamiento. En el bus todos los nodos reciben los datos aunque no se dirijan a todos &eacute;stos, los nodos a los que no van dirigidos los datos simplemente los ignoran.
<br><br>
									Existen dos grandes tipos clasificados por el m&eacute;todo de env&iacute;o de la informaci&oacute;n: paralelo o serial.
<br><br>
									Hay diferencias en el desempeño y hasta hace unos años se consideraba que el uso apropiado depend&iacute;a de la longitud f&iacute;sica de la conexi&oacute;n: para cortas distancias el bus paralelo, para largas el serial.
<br><br>

									<center><h2>BUS PARALELO</h2></center>
									Es un bus en el cual los datos son enviados por bytes al mismo tiempo, con la ayuda de varias l&iacute;neas que tienen funciones fijas. La cantidad de datos enviada es bastante grande con una frecuencia moderada y es igual al ancho de los datos por la frecuencia de funci&oacute;n computadores ha sido usado de manera intensiva, desde el bus del procesador, los buses de discos duros, tarjetas de expansi&oacute;n y de v&iacute;deo, hasta las impresoras.
<br><br>
									El Front Side Bus de los procesadores Intel es un bus de este tipo y como cualquier bus presenta unas funciones en l&iacute;neas dedicadas:
<br><br>
									Las L&iacute;neas de Direcci&oacute;n con el que se desea establecer comunicaci&oacute;n.
<br><br>
									Las L&iacute;neas de Control son las encargadas de enviar señales de arbitraje entre los dispositivos. Entre las m&aacute;s importantes est&aacute;n las l&iacute;neas de interrupci&oacute;n, DMA y los indicadores de estado.
<br><br>
									Las L&iacute;neas de Datos trasmiten los bits, de manera que por lo general un bus tiene un ancho que es potencia de 2.
<br><br>
									Un bus paralelo tiene conexiones f&iacute;sicas complejas, pero la l&oacute;gica es sencilla, que lo hace &uacute;til en sistemas con poco poder de c&oacute;mputo. En los primeros microcomputadores, el bus era simplemente la extensi&oacute;n del bus del procesador y los dem&aacute;s integrados “escuchan” la l&iacute;nea de direcciones, en espera de recibir instrucciones. En el PC IBM original, el diseño del bus fue determinante a la hora de elegir un procesador con I/O de 8 bits (Intel 8088), sobre uno de 16 (el 8086), porque era posible usar hardware diseñado para otros procesadores, abaratando el producto.
<br><br>
									<center><img src="imagenes/paralelo.jpg" height="450" width="200"></center>
									<center><h2>BUS SERIE</h2></center>
									En este los datos son enviados, bit a bit y se reconstruyen por medio de registros o rutinas de software. Est&aacute; formado por pocos conductores y su ancho de banda depende de la frecuencia. Es usado desde hace menos de 10 años en buses para discos duros, tarjetas de expansi&oacute;n y para el bus del procesador.
									<br><br>
									<center><img src="imagenes/serie.jpg" height="450" width="200"></center>

									<center>
									<br><br>

				</body>
</html>