<!DOCTYPE html>
<html>
			<head>
						<link rel="stylesheet" type="text/css" href="estlos.css">
						<title>2.2 Estructura de Registros</title>
			</head>
					<body>
							<header>
							
								<body style =" background-color: white; color: black; background attachment: fixed 100%; background-size: 100%; background-image: url(imagenes/fondo.jpg); link = # 32CD32; vlink = #32CD32; overflow: visible;" >	
				
								<h2 style ="font-family: courrier; color: white;   text-align: center;">2.2 Estructura de Registros</h2> 

								<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous"/>	
				

									<a href="index.html" class="btn btn-primary">Inicio</a>
									<a href="unidad2.html" class="btn btn-primary">Volver atr&aacute;s</a>
			</header>

									<center><h2>2.2 Estructura de Registros</h2></center>
									<center>
									<center><h2>多Qu&eacute; son los registros del CPU?</h2></center>
									Se emplean para controlar las instrucciones en ejecuci&oacute;n, manejar direccionamiento de memoria y propiciar la capacidad aritm&eacute;tica. Los registros vienen de tres tipos: datos, direcciones e &iacute;ndice, que tiene lugar en casi todos los aspectos de la operaci&oacute;n del CPU. El tama単o de un registro depende del CPU; los m&aacute;s simples tienen registros que aceptan 8 o 16 bits de datos y los m&aacute;s complejos tienen registros de 32, 48 o 64 bits.
<br><br>
									Registro de datos: Un CPU puede funcionar con datos en uno de tres modos: entre dos registros, entre registros y una ubicaci&oacute;n de Memoria de acceso al azar (RAM - Random-Access Memory) y entre dos ubicaciones RAM. Como el CPU est&aacute; conectado directamente a los registros, las operaciones que implican dos registros son las m&aacute;s r&aacute;pidas; las que se dan entre ubicaciones RAM son las m&aacute;s lentas. Es decir, junta dos registros, a単ade un registro a una ubicaci&oacute;n RAM, o a単ade dos ubicaciones RAM.
<br><br>
									Registro de direcciones: Para que un CPU pueda almacenar y recuperar datos en RAM, debe tener la direcci&oacute;n de la memoria de la informaci&oacute;n. Esas operaciones que implican RAM usan registros de direcci&oacute;n de memoria. EL CPU no realiza aritm&eacute;tica en estos registros; en cambio, los usa para ubicar datos que necesita.
<br><br>
									Registro de &iacute;ndice: Un CPU no puede hacer matem&aacute;ticas en registros de datos, aunque puede hacerlo indirectamente con un registro de &iacute;ndice. &eacute;ste trabaja con los registros de datos, permitiendo a un programa procesar hilos de informaci&oacute;n eficazmente.
<br><br>
									Registros de segmento: Un registro de segmento tiene 16 bits de longitud y facilita un &aacute;rea de memoria para direccionamiento conocida como segmento actual.
<br><br>
									Registro Cs: el dos almacena la direcci&oacute;n inicial del segmento de c&oacute;digo de un programa en el registro CS. Indica la direcci&oacute;n de una instrucci&oacute;n que es buscada para su ejecuci&oacute;n.
									Registro Ds: genera una referencia a la localidad de un byte espec&iacute;fico en el segmento de datos.
									Registro SS: permite la colocaci&oacute;n en memoria de una pila, para almacenamiento temporal de direcci&oacute;n y datos.
									Registro ES: se utiliza para algunas operaciones con cadenas de caracteres se utiliza para el manejo de direccionamiento de memoria.

									<br><br>
									<center><img src="imagenes/regis.webp" height="300" width="400"></center>

									<center>
									<br><br>

				</body>
</html>