<!DOCTYPE html>
<html>
			<head>
						<link rel="stylesheet" type="text/css" href="estlos.css">
						<title>2.4 Casos y estudio</title>
			</head>
					<body>
							<header>
							
								<body style =" background-color: white; color: black; background attachment: fixed 100%; background-size: 100%; background-image: url(imagenes/fondo.jpg); link = # 32CD32; vlink = #32CD32; overflow: visible;" >	
				
								<h2 style ="font-family: courrier; color: white;   text-align: center;">2.4 Casos y estudio</h2> 

								<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous"/>	
				

									<a href="index.html" class="btn btn-primary">Inicio</a>
									<a href="unidad2.html" class="btn btn-primary">Volver atr&aacute;s</a>
			</header>

									<center><h2>2.4 Casos y estudio</h2></center>
									<center>
									I-8086
									Los modos de direccionamiento del 8086 (Crawford & Gelsinger, 1987) son muy irregulares. Los registros del procesador, se usan para contener los datos con que se est&aacute; trabajando puesto que el acceso a los registros es mucho m&aacute;s r&aacute;pido que los accesos a memoria. Se pueden realizar operaciones aritm&eacute;ticas y l&oacute;gicas, comparaciones, entre otras.
<br><br>
									Hay un campo para un registro (reg), que especiﬁca uno de los operandos, y otros dos campos (mod y r/m) para el otro.

<br><br>
									Los modos del 8086 son indirectos por registro, indexados o directos por registro.
<br><br>
									<center><h2>Registros Prop&oacute;sito General</h2></center>
<br><br>
									Registro AX: El registro AX es el registro acumulador, es utilizado para operaciones que implican entrada/salida, y multiplicaci&oacute;n y divisi&oacute;n (estas dos &uacute;ltimas en conjunto con el registro DX).
									Registro BX: El registro BX es el registro base, y es el &uacute;nico registro de prop&oacute;sito general que puede ser un &iacute;ndice para direccionamiento indexado.
									Registro CX: El registro CX es conocido como el registro contador. Puede contener un valor para controlar el n&uacute;mero de veces que un ciclo se repite.
									Registro DX: El registro DX es el registro de datos.
<br><br>
									<center><h2>Registros &iacute;ndice</h2></center>
<br><br>
									Registro SI: El registro &iacute;ndice fuente de 16 bits es requerido por algunas operaciones con cadenas de caracteres.
									Registro DI: El registro &iacute;ndice destino tambi&eacute;n es requerido por algunas operaciones con cadenas de caracteres.
<br><br>
									<center><h2>Registros Apuntadores</h2></center>
<br><br>
									Registro SP: Apuntador de pila de 16 bits proporciona un valor de desplazamiento que se refiere a la palabra actual que est&aacute; siendo procesada en la pila.
									Registro BP: El apuntador base de 16 bits facilita la referencia de par&aacute;metros dentro de la pila.
<br><br>
									Motorola 68000: El mismo direccionamiento lleva impl&iacute;cito el tipo de registro sobre el que trabaja (direcciones o datos). Est&aacute; basado en dos bancos de 8 registros de 32 bits. Un banco es de datos (Dn) y el otro de punteros (An). Adem&aacute;s, contiene un contador de programa de 32 bits y un registro de estado de 16 bits.
<br><br>
									80386: Para este microprocesador existe un modo nuevo que requiere un byte adicional denominado SIB (escala, &iacute;ndice, base) que se añade al byte de operandos, es &uacute;til para direccionar elementos de vectores de longitudes diferentes en bucles. Es una alternativa a los modos autoindexados que esta m&aacute;quina no soporta.
									<br><br>
									

									<center>
									<br><br>

				</body>
</html>